The files krk-airlines.csv, krk-flights.csv and krk-passengers.csv contain data about flights from Krakow Airport. In a separate notebook, calculate and display:

- list including flight number and destination (two columns)

In [191]:
import pandas as pd

krk_airlines = pd.read_csv('krk-airlines.csv')
krk_passengers = pd.read_csv('krk-passengers.csv')
krk_flight = pd.read_csv('krk-flights.csv')

flights_and_airlines = pd.merge(krk_flight,krk_airlines,on='airlineid')
data = pd.merge(flights_and_airlines,krk_passengers,on='flight')

data.to_csv('data_planes.csv')

data.loc[:,['flight','to']].groupby(['flight','to']).sum()

Empty DataFrame
Columns: []
Index: [(BE321, Berlin), (LN222, London), (NY777, New York), (PA006, Paris)]

- flight list with the full name of the airline and the name of the aircraft

In [192]:
data.loc[:,['airline','airplane','flight']].groupby(['flight','airline','airplane']).sum()

Empty DataFrame
Columns: []
Index: [(BE321, SunHoliday, Airbus A319), (LN222, PanEurope, Boeing 787), (NY777, BlueSky, Airbus A330), (PA006, SunHoliday, Airbus A319)]

- a list of passengers on a flight to London sorted by surname

In [193]:
data.query("to == 'London'").loc[:,['name','surname','gender']].groupby(['name','surname','gender']).sum().sort_values(by="surname")

Empty DataFrame
Columns: []
Index: [(Claudie, Braid, Female), (Nehemiah, Budcock, Male), (Ingmar, Cockman, Male), (Willyt, Matlock, Female), (Rennie, McComiskey, Female), (Ferguson, Osban, Male), (Nolana, Pattie, Female), (Mareah, Peplay, Female), (Araldo, Permain, Male), (Stormy, Quare, Female), (Edik, Smieton, Male), (Lindi, Snoad, Female), (Emmanuel, Tickel, Male), (Ashton, Tregunna, Male), (Brewster, Vear, Male)]

- a list of women flying to Paris ordered by surname

In [194]:
data.query("to == 'Paris' and gender == 'Female'").loc[:,['name','surname']].groupby(['name','surname']).sum().sort_values(by="surname")

Empty DataFrame
Columns: []
Index: [(Miguela, Benzie), (Heath, Butterfill), (Erminie, Earland), (Janene, Elger), (Alene, Emig), (Chelsae, Evins), (Fanny, Fennessy), (Paige, Freeborne), (Genevra, Garlicke), (Linda, Kupper), (Annemarie, Letson), (Lia, Mapston), (Korry, McGrann), (Ivette, Milesap), (Leann, Pinkerton), (Cloe, Salzberg), (Prisca, Scutching), (Kip, Sumpton), (Blanch, Tink), (Talia, Yendle)]

- number of passengers on the flight to Berlin

In [195]:
data.query("to == 'Berlin'").loc[:,['to','name','surname']].groupby(['name','surname']).count().sum()

to    17
dtype: int64

- number of men flying from Krakow

In [196]:
data.query("`from` == 'Krakow' and gender == 'Male'").loc[:,['to','name','surname']].groupby(['name','surname']).count().sum()

to    54
dtype: int64

- number of passengers for each flight

In [197]:
data.loc[:,['to','name','surname']].groupby(['name','surname']).count().sum()

to    100
dtype: int64